# IndexLine Properties

---
The IndexLine type exposes the following members.
| Name| Description
---|---|---
| Index0|  The index of the line segment's first vertex.
| Index1|  The index of the line segment's second vertex.
| IsValidObject|  Specifies whether the .NET object represents a valid Revit entity. (Inherited from IndexPrimitive)
Top
#### Reference
IndexLine Class
Autodesk.Revit.DB.DirectContext3D Namespace